app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES('gautham', 'not bad, verry nice!', 3, '2010-05-20 17:31:39', '2010-05-20 17:31:39')
---
def create
@post = Post.find(params[:post_id])
@comment = @post.comments.build(params[:comment])
if @comment.save