app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "created_at", "title", "updated_at", "content") VALUES('Gautham', '2010-05-20 07:42:06', 'First One...', '2010-05-20 07:42:06', 'This is my first entry while living in the Rails World!')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "updated_at" = '2010-05-20 07:42:48', "title" = 'First One', "content" = 'There isn’t much to this file – but note that the Post class inherits from ActiveRecord::Base. Active Record supplies a great deal of functionality to your Rails models for free, including basic database CRUD (Create, Read, Update, Destroy) operations, data validation, as well as sophisticated search support and the ability to relate multiple models to one another.' WHERE "id" = 1
---
  def update
    respond_to do |format|
      if @post.update_attributes(params[:post])

DELETE FROM "posts" WHERE "id" = 1
---
  def destroy
    @post.destroy

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
	def find_post
		@post = Post.find(params[:id])